<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 会话设置
// +----------------------------------------------------------------------

return [
    'type'       => \think\facade\Env::get('REDIS.TYPEREDIS'),
    'auto_start' => true,
    // redis主机
    'host'       => \think\facade\Env::get('REDIS.HOSTREDIS'),
    // redis端口
    'port'       => \think\facade\Env::get('REDIS.PORTREDIS'),
    // 密码
    'password'   => '',
];
